IDENTIFICATION DIVISION.
PROGRAM-ID. FACTORIAL.
DATA DIVISION.
    WORKING-STORAGE SECTION.
        77 N    PIC 99.
        77 STO  PIC 99.
        77 FAKT PIC 9999.
PROCEDURE DIVISION.
    SET N   TO 7.
    SET STO TO 1.
    SET FAKT TO 1.
    PERFORM VARYING STO FROM 1 BY 1 UNTIL STO>N
    DISPLAY STO
        MULTIPLY FAKT BY STO GIVING FAKT    
    END-PERFORM.
    DISPLAY "RESULT ="FAKT.
STOP RUN.
