IDENTIFICATION DIVISION.
PROGRAM-ID. HITUNG-GAJI.
DATA DIVISION.
    WORKING-STORAGE SECTION.
    01 NAMA-KARYAWAN PIC X(07).
    01 JAM-KERJA     PIC 9(06).
    01 GAJI-OUT      PIC 9(08).
    
PROCEDURE DIVISION.
    DISPLAY 'HAPUS-LAYAR'.
    DISPLAY 'NAMA KARYAWAN ? : '.
    ACCEPT NAMA-KARYAWAN.
    DISPLAY 'JAM JERJA SEBULAN ? : '.
    ACCEPT JAM-KERJA.
    
    COMPUTE GAJI-OUT = JAM-KERJA * 500.
    DISPLAY 'GAJI SEBULAN ADALAH: 'GAJI-OUT.
    
STOP RUN.

